{
  "backend/main.mo": "Main Motoko actor defining Video, ScheduledPost, and Itinerary types with CRUD operations for two workspaces (travel/aiLearning) and three platforms (facebook/instagram/tiktok), including blob storage mixin for file uploads.",
  "feature_evidence.json": "Feature evidence report documenting three authentication-related features in VideoUpload.tsx: hiding login button when authenticated, reading isAuthenticated state correctly, and removing duplicate login logic causing errors.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend components describing the app structure: workspace management, video upload with authentication, media library, calendar scheduling, and AI caption generation with manual posting workflow.",
  "frontend/index.css": "Tailwind CSS configuration with dark theme OKLCH color variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors in both light and dark modes.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'NicheHub' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the app in ThemeProvider (dark mode), WorkspaceProvider, Layout, and three-tab navigation (Media Library, Schedule, Script Lab) with Toaster for notifications.",
  "frontend/src/components/Calendar.tsx": "Monthly calendar view with prev/next navigation, displaying scheduled posts per date, supporting drag-and-drop of videos onto dates to trigger TimePickerModal for scheduling.",
  "frontend/src/components/DateTimePickerModal.tsx": "Modal dialog with calendar date picker and time input for scheduling posts, validating that selected datetime is in the future before confirming.",
  "frontend/src/components/HelpModal.tsx": "Informational modal explaining the four-step workflow: upload videos, generate AI captions, schedule posts, and manually copy/paste to social platforms.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, footer, and authentication controls. Handles Internet Identity login/logout with toast notifications and includes a help modal trigger.",
  "frontend/src/components/MediaLibrary.tsx": "Displays a grid of uploaded videos with upload functionality. Manages video selection for repurposing and playback through modal dialogs.",
  "frontend/src/components/PostNowButton.tsx": "Empty file with no content.",
  "frontend/src/components/RepurposeModal.tsx": "Modal dialog for generating and editing AI-powered captions for Facebook, Instagram, and TikTok. Includes platform selection, caption editing, copy functionality, and scheduling integration.",
  "frontend/src/components/ScheduleButton.tsx": "Button component that opens a date-time picker modal and handles scheduling posts across multiple platforms with caption data.",
  "frontend/src/components/ScheduledPostItem.tsx": "Displays a single scheduled post with thumbnail, time, platform icons, and a copy-to-clipboard button for captions.",
  "frontend/src/components/ScriptLab.tsx": "AI-powered script generation tool for travel videos that creates editable itinerary scripts with hook, daily breakdown, and CTA sections.",
  "frontend/src/components/TimePickerModal.tsx": "Modal for selecting time and platforms when scheduling a post, with integrated caption generation and validation for future dates.",
  "frontend/src/components/VideoCard.tsx": "Displays a video card with thumbnail/preview, caption, drag-and-drop support, play overlay on hover, and a repurpose button. Handles click events to play video while preventing button clicks from triggering playback.",
  "frontend/src/components/VideoPlayerModal.tsx": "Modal dialog component that displays a full-screen video player with controls and autoplay. Shows the video caption as the dialog title.",
  "frontend/src/components/VideoUpload.tsx": "Handles video file selection, thumbnail generation, and upload with progress tracking. Requires Internet Identity authentication and displays upload progress or login prompt based on auth state.",
  "frontend/src/components/WorkspaceToggle.tsx": "Toggle component for switching between Travel and AI Learning workspaces. Displays two buttons with icons and persists selection via WorkspaceContext.",
  "frontend/src/contexts/WorkspaceContext.tsx": "React context provider for managing workspace state (Travel or AI Learning) with localStorage persistence. Provides workspace getter and setter to child components.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks with login, logout, and identity state management. Creates and manages AuthClient with configurable options and delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching videos and scheduled posts by workspace, and a mutation hook for uploading videos with progress tracking using ExternalBlob. Handles query invalidation and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme colors, spacing, and design tokens. Includes touch-friendly minimum sizes and smooth scrolling for mobile.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/utils/captionGenerator.ts": "Generates platform-specific social media captions (Facebook, Instagram, TikTok) from an original caption with simulated AI delay, adding appropriate hashtags, emojis, and platform-optimized formatting.",
  "frontend/src/utils/itineraryGenerator.ts": "Generates a structured 3-day travel itinerary script with a hook, daily activities, and CTA from a video caption, simulating AI generation with a 2-second delay.",
  "frontend/src/utils/socialPlatformPublisher.ts": "Empty file with no content.",
  "frontend/src/utils/thumbnailGenerator.ts": "Extracts a JPEG thumbnail from a video file by seeking to 1 second or 10% duration, drawing the frame to canvas, and converting to Uint8Array with detailed logging.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar/chart colors, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing NicheHub as a mobile-first content management app with workspace management, AI caption generation, calendar scheduling, Internet Identity auth, and known issues with video upload and login button errors."
}