{
  "backend/main.mo": "Main Motoko actor defining Video and ScheduledPost types with storage maps, providing functions to upload videos, schedule posts, and query them by workspace (travel or aiLearning).",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: replacing 'Post Now' with 'Copy Captions', updating scheduled posts workflow to clarify manual posting, and removing simulated social platform publishing utilities.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components, hooks, and utilities describing their roles in video upload, caption generation, scheduling, authentication, and workspace management.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark themes with custom properties for UI components.",
  "frontend/index.html": "HTML entry point for the NicheHub application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the app with ThemeProvider and WorkspaceProvider, rendering Layout with tabbed navigation between Media Library and Schedule Calendar views.",
  "frontend/src/components/Calendar.tsx": "Monthly calendar component displaying scheduled posts with drag-and-drop support for scheduling videos, navigation controls, and integration with TimePickerModal for dropped videos.",
  "frontend/src/components/DateTimePickerModal.tsx": "Modal dialog with calendar and time input for selecting future dates/times to schedule posts, with validation preventing past date selection.",
  "frontend/src/components/HelpModal.tsx": "A dialog modal that explains the four-step workflow of NicheHub: uploading videos, generating AI captions, scheduling posts, and manually copying/posting to social platforms.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header (logo, help button, login/logout), footer (social icons, attribution), and a container for child content.",
  "frontend/src/components/MediaLibrary.tsx": "Displays a grid of uploaded videos with upload functionality and opens a repurpose modal when a video is selected for caption generation.",
  "frontend/src/components/PostNowButton.tsx": "Empty file with no content.",
  "frontend/src/components/RepurposeModal.tsx": "Modal for generating and editing platform-specific captions (Facebook, Instagram, TikTok) with options to copy all captions or schedule posts for selected platforms.",
  "frontend/src/components/ScheduleButton.tsx": "Button component that opens a date/time picker modal and handles scheduling posts for multiple platforms with the provided captions.",
  "frontend/src/components/ScheduledPostItem.tsx": "Displays a scheduled post with video thumbnail, time, platform icons, and a copy button to copy all platform captions to clipboard.",
  "frontend/src/components/TimePickerModal.tsx": "Modal for selecting time and platforms when scheduling a post from the calendar, with caption generation and validation before confirming the schedule.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying a video thumbnail/preview with caption text and a repurpose button, supporting drag-and-drop for calendar scheduling.",
  "frontend/src/components/VideoUpload.tsx": "React component that handles video file uploads with authentication checks, progress tracking, and workspace context integration. Converts selected video files to Uint8Array and uploads them via the useUploadVideo hook.",
  "frontend/src/components/WorkspaceToggle.tsx": "React component providing a toggle UI to switch between Travel and AI Learning workspaces using icons and buttons. Reads and updates workspace state from WorkspaceContext.",
  "frontend/src/contexts/WorkspaceContext.tsx": "React context provider that manages workspace state (Travel or AI Learning) with localStorage persistence. Provides workspace getter/setter to child components via useWorkspace hook.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching videos and scheduled posts by workspace, uploading videos with progress tracking, and scheduling posts. Handles cache invalidation and toast notifications for mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme colors using OKLCH color space. Includes base styles for touch-friendly UI, smooth scrolling, and mobile optimizations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component. Configures the provider hierarchy for global state management.",
  "frontend/src/utils/captionGenerator.ts": "Utility function that generates platform-specific captions (Facebook, Instagram, TikTok) from a base caption with appropriate formatting, hashtags, and engagement prompts. Simulates AI generation with a delay.",
  "frontend/src/utils/socialPlatformPublisher.ts": "Empty utility file, likely intended for future implementation of social media platform publishing functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, container settings, border radius variables, and animation keyframes. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file defining NicheHub, a mobile content management and social media scheduling app with multi-workspace support (Travel/AI Learning), AI caption generation, and calendar-based scheduling. Includes architectural notes, existing features (workspace toggle, video upload, AI repurposing, calendar scheduling, Internet Identity auth), and planned features (analytics, notifications, batch operations)."
}