{
  "backend/main.mo": "Main Motoko actor defining Video, ScheduledPost, and Itinerary types with CRUD operations for two workspaces (travel, aiLearning) and three social platforms (facebook, instagram, tiktok), including blob storage mixin for file handling.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for video text overlay and caption burning functionality across ScriptLab and RepurposeModal components with high confidence test coverage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App structure, workspace management, media library, video upload/repurpose flows, scheduling calendar, and utility functions for caption generation and social publishing.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for UI components including sidebar, charts, and semantic color tokens.",
  "frontend/index.html": "HTML entry point for NicheHub application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the app with ThemeProvider, WorkspaceProvider, and Layout, containing three-tab navigation (Media Library, Schedule, Script Lab) using shadcn Tabs.",
  "frontend/src/components/Calendar.tsx": "Monthly calendar view component displaying scheduled posts with drag-and-drop support for scheduling videos onto specific dates, triggering TimePickerModal on drop.",
  "frontend/src/components/DateTimePickerModal.tsx": "Modal dialog with calendar date picker and time input for scheduling posts with validation ensuring future dates only.",
  "frontend/src/components/HelpModal.tsx": "A dialog modal component that displays a 4-step guide explaining how NicheHub works: uploading videos, generating AI captions, scheduling posts, and manually copying/posting to social platforms.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component providing header with login/logout buttons, help modal trigger, footer with social media icons, and toast notifications for authentication events.",
  "frontend/src/components/MediaLibrary.tsx": "Displays a grid of uploaded videos with VideoUpload component, handles video selection for repurposing and playback through modals, and shows loading/empty states.",
  "frontend/src/components/PostNowButton.tsx": "Empty file with no content.",
  "frontend/src/components/RepurposeModal.tsx": "Modal for generating and editing platform-specific captions (Facebook, Instagram, TikTok) for videos, with options to schedule posts, copy captions, and export videos with text overlays using video processing hooks.",
  "frontend/src/components/ScheduleButton.tsx": "Button component that opens a date/time picker modal and schedules posts for selected platforms using the useSchedulePost mutation hook.",
  "frontend/src/components/ScheduledPostItem.tsx": "Displays a scheduled post card with video thumbnail, scheduled time, platform icons, and a copy button to copy all platform captions to clipboard.",
  "frontend/src/components/ScriptLab.tsx": "Component for generating and editing travel itinerary scripts (hook, daily activities, CTA) from video captions using AI, with options to copy scripts and export videos with text overlays.",
  "frontend/src/components/TextOverlaySettings.tsx": "React component providing UI controls for configuring text overlay settings (font, color, position) on videos using shadcn/ui components. Exports TextOverlayConfig interface and accepts settings/onChange props.",
  "frontend/src/components/TimePickerModal.tsx": "Modal dialog for scheduling video posts across multiple platforms (Facebook, Instagram, TikTok) with time selection and AI caption generation. Handles post scheduling with workspace context and displays a note that scheduling is for planning only.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying video thumbnail/preview with drag-and-drop support, play functionality, and a repurpose button. Shows video caption and handles thumbnail/video URL generation from backend Video objects.",
  "frontend/src/components/VideoPlayerModal.tsx": "Simple modal dialog component that displays a full-screen video player with controls for a given Video object. Uses shadcn/ui Dialog and generates direct video URLs from backend.",
  "frontend/src/components/VideoUpload.tsx": "Video upload component with authentication check, file selection, thumbnail generation, and progress tracking. Requires Internet Identity login and handles video file processing before uploading to workspace.",
  "frontend/src/components/WorkspaceToggle.tsx": "Toggle button component for switching between Travel and AI Learning workspaces using context. Displays workspace-specific icons and highlights the active workspace.",
  "frontend/src/contexts/WorkspaceContext.tsx": "React context provider for managing workspace state (Travel or AI Learning) with localStorage persistence. Exports WorkspaceProvider component and useWorkspace hook.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances based on Internet Identity authentication state. Automatically invalidates dependent queries when actor changes and handles both authenticated and anonymous actors.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and context provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching videos and scheduled posts by workspace, plus a mutation hook for uploading videos with progress tracking using ExternalBlob and thumbnail support.",
  "frontend/src/hooks/useVideoProcessor.ts": "React hook that wraps video processing functionality with state management for processing status, progress tracking, and error handling when adding text overlays to videos.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme design system including colors, spacing, and mobile-friendly touch targets.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/captionGenerator.ts": "Generates platform-specific social media captions (Facebook, Instagram, TikTok) with different personas based on workspace type—cinematic travel expert for travel workspace, generic style for AI learning workspace.",
  "frontend/src/utils/itineraryGenerator.ts": "Generates a 3-day travel itinerary script with cinematic hooks, detailed daily plans in Travel Expert persona, and call-to-action for social media video content.",
  "frontend/src/utils/socialPlatformPublisher.ts": "Empty file, likely placeholder for future social media platform publishing functionality.",
  "frontend/src/utils/thumbnailGenerator.ts": "Extracts a JPEG thumbnail from a video file by seeking to 1 second or 10% duration, drawing the frame to canvas, and converting to Uint8Array with detailed logging.",
  "frontend/src/utils/videoProcessor.ts": "Implements a VideoProcessor class that overlays text on videos using canvas rendering and MediaRecorder API. Handles video processing with progress callbacks, text wrapping, positioning, audio extraction, and exports processed video as WebM blob.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, sidebar colors, custom animations (accordion), border radius variables, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite configuration for React app with path aliases, API proxy to localhost:8000, COOP/COEP headers for SharedArrayBuffer support, environment variable plugins for canister IDs, and FFmpeg optimization exclusions.",
  "project_state.json": "Project state document for NicheHub, a mobile-first content management app with workspace management, AI caption generation, calendar scheduling, and Internet Identity auth. Known issues include broken video upload, authentication errors, and video preview failures."
}