{
  "backend/main.mo": "Main Motoko actor defining Video and ScheduledPost types with workspace separation (travel/aiLearning), providing functions to upload videos with thumbnails, schedule posts with platform-specific captions, and query videos/posts by workspace.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: HD video player with standard controls for .mp4/4K playback, and thumbnail generation/display for video preview in the media gallery.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, utilities, and configuration files describing the video upload, caption generation, scheduling, and workspace management functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme CSS variables for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting the app from main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the app with ThemeProvider and WorkspaceProvider, rendering Layout with tabbed navigation between Media Library and Schedule Calendar views.",
  "frontend/src/components/Calendar.tsx": "Monthly calendar component displaying scheduled posts with drag-and-drop support for scheduling videos onto specific dates, triggering TimePickerModal on drop.",
  "frontend/src/components/DateTimePickerModal.tsx": "Modal dialog with calendar date picker and time input for scheduling posts, validating that selected datetime is in the future before confirming.",
  "frontend/src/components/HelpModal.tsx": "Help modal explaining the four-step workflow: upload videos, generate AI captions, schedule posts, and manually copy/paste to social platforms.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header (logo, help button, login/logout), footer (social icons, attribution), and a modal for help. Wraps children content and uses Internet Identity authentication.",
  "frontend/src/components/MediaLibrary.tsx": "Displays a grid of uploaded videos with VideoUpload component, handles video selection for repurposing and playback via modals. Shows loading state and empty state when no videos exist.",
  "frontend/src/components/PostNowButton.tsx": "Empty file with no content.",
  "frontend/src/components/RepurposeModal.tsx": "Modal for generating and editing AI-powered captions for Facebook, Instagram, and TikTok. Includes platform selection, caption editing, copy-to-clipboard functionality, and scheduling integration.",
  "frontend/src/components/ScheduleButton.tsx": "Button component that opens a date/time picker modal and schedules posts across selected platforms with generated captions. Handles scheduling mutation and displays loading state.",
  "frontend/src/components/ScheduledPostItem.tsx": "Displays a compact scheduled post item with thumbnail, time, platform icons, and a copy-captions button. Shows formatted captions for all three platforms when copied.",
  "frontend/src/components/TimePickerModal.tsx": "Modal for selecting time and platforms when scheduling a post from calendar view. Generates captions on-demand and validates future time selection before scheduling.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying video thumbnail/preview with caption and repurpose button. Supports drag-and-drop for calendar scheduling and click-to-play functionality.",
  "frontend/src/components/VideoPlayerModal.tsx": "Full-screen modal for playing videos with native controls. Displays video title and prevents download via controlsList attribute.",
  "frontend/src/components/VideoUpload.tsx": "React component that handles video file uploads with thumbnail generation, progress tracking, and authentication checks. Displays an upload button that is disabled when not logged in and shows progress during upload.",
  "frontend/src/components/WorkspaceToggle.tsx": "React component that renders a toggle button group for switching between Travel and AI Learning workspaces. Uses icons and persists selection through the WorkspaceContext.",
  "frontend/src/contexts/WorkspaceContext.tsx": "React context provider that manages the current workspace state (Travel or AI Learning) and persists it to localStorage. Provides workspace getter and setter to child components.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous actor for backend communication based on Internet Identity. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation. Provides login, logout, and authentication status to child components.",
  "frontend/src/hooks/useQueries.ts": "Custom React hooks for data fetching and mutations using TanStack Query, including video uploads, scheduled posts retrieval, and post scheduling. Handles query invalidation and toast notifications.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives and custom CSS variables for theming (colors, spacing, borders). Includes mobile-friendly touch targets and smooth scrolling behavior.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers. Renders the main App component.",
  "frontend/src/utils/captionGenerator.ts": "Utility function that generates platform-specific social media captions (Facebook, Instagram, TikTok) from a base caption. Simulates AI generation with a delay and adds appropriate hashtags and formatting.",
  "frontend/src/utils/socialPlatformPublisher.ts": "Empty utility file, likely intended for future social media platform publishing functionality.",
  "frontend/src/utils/thumbnailGenerator.ts": "Utility function that extracts a thumbnail image from a video file by seeking to 1 second or 10% duration, capturing a frame to canvas, and converting it to JPEG bytes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color tokens using OKLCH color space (with CSS variables for theming), extends border radius and animations, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state document describing NicheHub, a mobile-first content management app with workspace switching (Travel/AI Learning), video upload, AI caption generation for social platforms, calendar scheduling, and Internet Identity authentication with manual export workflow."
}