{
  "backend/main.mo": "Main Motoko actor defining Video, ScheduledPost, and Itinerary types with CRUD operations for managing videos, scheduled posts, and itineraries across Travel and AI Learning workspaces, including blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features related to debugging and verifying the VideoUpload component's Internet Identity login flow integration.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, utilities, and configuration files describing the application's UI structure, authentication, video management, and scheduling features.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme CSS variables for backgrounds, foregrounds, borders, and component colors.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Root React component wrapping the app with ThemeProvider, WorkspaceProvider, Layout, and three-tab navigation (Media Library, Schedule, Script Lab) using shadcn/ui components.",
  "frontend/src/components/Calendar.tsx": "Monthly calendar view component displaying scheduled posts with drag-and-drop support for scheduling videos, navigation between months, and integration with TimePickerModal for setting post times.",
  "frontend/src/components/DateTimePickerModal.tsx": "Modal dialog with calendar date picker and time input for scheduling posts, validating that selected datetime is in the future before confirming.",
  "frontend/src/components/HelpModal.tsx": "Help modal explaining the four-step workflow: upload videos, generate AI captions, schedule posts, and manually copy/post to social platforms.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, footer, and authentication controls. Handles Internet Identity login/logout with toast notifications and includes a help modal trigger.",
  "frontend/src/components/MediaLibrary.tsx": "Displays a grid of uploaded videos with upload functionality. Manages video selection for repurposing and playback through modals.",
  "frontend/src/components/PostNowButton.tsx": "Empty file with no content.",
  "frontend/src/components/RepurposeModal.tsx": "Modal for generating and editing AI-powered platform-specific captions (Facebook, Instagram, TikTok) for videos. Includes platform selection, caption editing, copy functionality, and scheduling integration.",
  "frontend/src/components/ScheduleButton.tsx": "Button component that opens a date-time picker modal and handles scheduling posts across selected platforms with generated captions.",
  "frontend/src/components/ScheduledPostItem.tsx": "Displays a scheduled post item with thumbnail, time, platform icons, and a copy-to-clipboard button for captions.",
  "frontend/src/components/ScriptLab.tsx": "AI-powered script generation tool for travel videos that creates editable itinerary scripts with hook, daily breakdown, and CTA sections. Includes video selection grid and copy-to-clipboard functionality.",
  "frontend/src/components/TimePickerModal.tsx": "Modal for selecting time and platforms when scheduling a post from the calendar view. Generates captions on-demand and validates future scheduling times.",
  "frontend/src/components/VideoCard.tsx": "Displays a video card with thumbnail/preview, caption, drag-and-drop support, and a repurpose button. Clicking the card triggers video playback via an optional onPlay callback.",
  "frontend/src/components/VideoPlayerModal.tsx": "Modal dialog component that displays a full-screen video player with controls for a given Video object.",
  "frontend/src/components/VideoUpload.tsx": "Handles video file selection and upload with thumbnail generation, progress tracking, and Internet Identity authentication gating. Displays upload progress and login/upload state.",
  "frontend/src/components/WorkspaceToggle.tsx": "Toggle component that switches between Travel and AI Learning workspaces using context state.",
  "frontend/src/contexts/WorkspaceContext.tsx": "React context provider that manages current workspace state (Travel or AI Learning) with localStorage persistence.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login, logout, and identity management using @dfinity/auth-client with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching videos and scheduled posts, uploading videos with progress tracking, scheduling posts, and saving itineraries via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme, touch-friendly sizing, and smooth scrolling optimizations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/captionGenerator.ts": "Simulates AI caption generation by creating platform-specific captions (Facebook, Instagram, TikTok) from an original caption, each with appropriate tone, hashtags, and formatting for that platform.",
  "frontend/src/utils/itineraryGenerator.ts": "Generates a 3-day travel itinerary script with a cinematic hook, detailed daily activities, and a call-to-action, simulating AI generation with a 2-second delay.",
  "frontend/src/utils/socialPlatformPublisher.ts": "Empty file with no content.",
  "frontend/src/utils/thumbnailGenerator.ts": "Extracts a thumbnail image from a video file by seeking to 1 second (or 10% duration), drawing the frame to canvas, and returning it as a JPEG Uint8Array.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme tokens for UI components (sidebar, chart, card, etc.), and animation utilities for accordions.",
  "project_state.json": "Project metadata describing NicheHub as a mobile content management app with workspace management, AI caption generation, calendar scheduling, Internet Identity auth, and manual social media export workflow without direct API integrations."
}