{
  "backend/main.mo": "Main Motoko actor defining Video, ScheduledPost, and Itinerary types with CRUD operations for uploading videos, scheduling posts across platforms (Facebook, Instagram, TikTok), and managing travel itineraries across two workspaces (travel and aiLearning).",
  "feature_evidence.json": "Feature evidence report documenting three debugging tasks related to video upload flow issues, including verification of file input binding, mutation state handling, and comprehensive error logging across frontend and backend components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing the React application structure with workspace management, video upload/library, scheduling calendar, and social media caption generation features.",
  "frontend/index.css": "Tailwind CSS configuration with dark theme OKLCH color variables for background, foreground, card, popover, primary, secondary, muted, accent, destructive, border, input, ring, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the NicheHub application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the app with ThemeProvider, WorkspaceProvider, Layout, and three-tab navigation (Media Library, Schedule, Script Lab) using shadcn/ui Tabs.",
  "frontend/src/components/Calendar.tsx": "Monthly calendar view component displaying scheduled posts with drag-and-drop support for scheduling videos, navigation between months, and integration with TimePickerModal for setting post times.",
  "frontend/src/components/DateTimePickerModal.tsx": "Modal dialog with calendar date picker and time input for scheduling posts, validating that selected datetime is in the future before confirming.",
  "frontend/src/components/HelpModal.tsx": "A modal dialog component that displays a 4-step guide explaining how NicheHub works: uploading videos, generating AI captions, scheduling posts, and manually copying/posting to social platforms.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component providing header with login/logout functionality, help button, footer with social media icons, and toast notifications for authentication events.",
  "frontend/src/components/MediaLibrary.tsx": "Displays a grid of uploaded videos with upload functionality, handles video selection for repurposing and playback through modal dialogs.",
  "frontend/src/components/PostNowButton.tsx": "Empty file with no content.",
  "frontend/src/components/RepurposeModal.tsx": "Modal for generating and editing platform-specific captions (Facebook, Instagram, TikTok) for a video, with options to copy captions and schedule posts across selected platforms.",
  "frontend/src/components/ScheduleButton.tsx": "Button component that opens a date/time picker modal and handles scheduling posts for multiple platforms with validation and toast notifications.",
  "frontend/src/components/ScheduledPostItem.tsx": "Displays a scheduled post item in the calendar with video thumbnail, scheduled time, platform icons, and a copy button to copy all captions for manual posting.",
  "frontend/src/components/ScriptLab.tsx": "Allows users to select a travel video and generate an editable AI-powered itinerary script with hook, daily breakdown, and call-to-action sections that can be copied to clipboard.",
  "frontend/src/components/TimePickerModal.tsx": "Modal component for scheduling social media posts with time selection, platform selection (Facebook, Instagram, TikTok), and AI-powered caption generation. Handles post scheduling with validation and displays a note that scheduling is for planning only and requires manual posting.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying video thumbnails with drag-and-drop support, play functionality on click, and a repurpose button. Shows video caption and includes hover effects with a play icon overlay.",
  "frontend/src/components/VideoPlayerModal.tsx": "Modal dialog component that displays a full-screen video player with controls for playing uploaded videos. Renders the video with native HTML5 controls and prevents downloading.",
  "frontend/src/components/VideoUpload.tsx": "Video upload component with Internet Identity authentication, thumbnail generation, and progress tracking. Handles file selection, validation, and uploads video files with thumbnails to the backend canister.",
  "frontend/src/components/WorkspaceToggle.tsx": "Toggle component for switching between two workspaces: Travel and AI Learning. Uses context to persist workspace selection and displays workspace-specific icons.",
  "frontend/src/contexts/WorkspaceContext.tsx": "React context provider for managing workspace state (Travel or AI Learning) with localStorage persistence. Provides workspace getter and setter functions to child components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and authentication status tracking with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching videos and scheduled posts by workspace, and a mutation hook for uploading videos with progress tracking using ExternalBlob. Includes extensive logging for debugging video upload flow.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme colors (OKLCH color space), touch-friendly minimum sizes for mobile, and smooth scrolling behavior.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/captionGenerator.ts": "Simulates AI-generated platform-specific captions (Facebook, Instagram, TikTok) with appropriate formatting, hashtags, and engagement prompts based on input caption text.",
  "frontend/src/utils/itineraryGenerator.ts": "Generates structured 3-day travel itinerary scripts with cinematic hooks, daily activities, and call-to-action prompts for video content creation.",
  "frontend/src/utils/socialPlatformPublisher.ts": "Empty file, likely placeholder for future social media publishing functionality.",
  "frontend/src/utils/thumbnailGenerator.ts": "Extracts a JPEG thumbnail from video files by seeking to 1 second or 10% duration, drawing the frame to canvas, and converting to Uint8Array with detailed logging.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom OKLCH color system, container settings, extended theme with sidebar/chart colors, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata describing NicheHub as a mobile-first content management app with workspace switching, AI caption generation, calendar scheduling, and manual social media export workflow. Notes video upload is currently broken."
}