{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add video text overlay engine with customizable captions and export",
  "requirements": [
    {
      "id": "REQ-41",
      "summary": "Integrate video processing library for burning text overlays onto videos",
      "acceptanceCriteria": [
        "ffmpeg.wasm or equivalent video processing library is installed and initialized in the frontend",
        "The system can load a video file and render text overlays onto it",
        "Text can be permanently burned into the video output file"
      ],
      "file_operations": [
        {
          "path": "frontend/package.json",
          "operation": "modify",
          "description": "Add @ffmpeg/ffmpeg and @ffmpeg/util as dependencies to enable client-side video processing with text overlay capabilities"
        },
        {
          "path": "frontend/src/utils/videoProcessor.ts",
          "operation": "create",
          "description": "Create a video processing utility that initializes ffmpeg.wasm, loads video files, applies text overlays with customizable font/color/position, and exports processed videos as MP4 files with progress tracking"
        },
        {
          "path": "frontend/src/hooks/useVideoProcessor.ts",
          "operation": "create",
          "description": "Create a React hook that manages ffmpeg initialization state, provides methods for processing videos with text overlays, tracks processing progress, and handles loading/error states"
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Add text overlay customization controls in ScriptLab for font, color, and position selection",
      "acceptanceCriteria": [
        "A settings panel appears in ScriptLab after script generation with Font, Color, and Position controls",
        "Users can select from multiple font options",
        "Users can choose text color via color picker or preset colors",
        "Users can choose text position: Top, Center, or Bottom",
        "Selected settings are preserved when generating the final video output"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TextOverlaySettings.tsx",
          "operation": "create",
          "description": "Create a reusable settings panel component with font selector dropdown (e.g., Arial, Helvetica, Impact, Times New Roman), color picker input for text color, and position radio buttons (Top/Center/Bottom). Use shadcn/ui components (Select, Input, RadioGroup, Label) for consistent styling."
        },
        {
          "path": "frontend/src/components/ScriptLab.tsx",
          "operation": "modify",
          "description": "Import and render the TextOverlaySettings component after script generation is complete. Store selected overlay settings (font, color, position) in component state and pass them to the export functionality. Display the settings panel conditionally when a script exists and a video is selected."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Add Export with Captions button in ScriptLab to render and download captioned videos",
      "acceptanceCriteria": [
        "An 'Export with Captions' button is visible in ScriptLab after script generation and overlay settings are configured",
        "Clicking the button triggers video processing that burns the script text onto the video",
        "The processed video maintains high quality and original resolution",
        "A download link or automatic download is provided for the captioned video file",
        "The exported video file is in a format compatible with mobile devices and social media platforms (MP4)",
        "Processing progress is displayed with a loading indicator",
        "Success and error states are communicated via toast notifications"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ScriptLab.tsx",
          "operation": "modify",
          "description": "Add an 'Export with Captions' button (using shadcn Button component) that appears after script generation. Wire the button to call useVideoProcessor hook with the selected video URL (via ExternalBlob.getDirectURL()), formatted script text, and overlay settings (font, color, position). Display processing progress with a progress bar or spinner. Show success toast with download link on completion, and error toast on failure. Automatically trigger file download when processing completes."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Add text overlay customization controls in RepurposeModal for font, color, and position selection",
      "acceptanceCriteria": [
        "A settings panel appears in RepurposeModal after caption generation with Font, Color, and Position controls",
        "Users can select from multiple font options",
        "Users can choose text color via color picker or preset colors",
        "Users can choose text position: Top, Center, or Bottom",
        "Selected settings are preserved for the export operation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RepurposeModal.tsx",
          "operation": "modify",
          "description": "Import and render the TextOverlaySettings component after AI captions are generated. Store selected overlay settings (font, color, position) in component state for use during export. Display the settings panel conditionally when captions exist for at least one platform."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Add Export with Captions button in RepurposeModal to render and download platform-specific captioned videos",
      "acceptanceCriteria": [
        "An 'Export with Captions' button is visible in RepurposeModal after captions are generated and overlay settings are configured",
        "Clicking the button triggers video processing that burns the selected platform caption text onto the video",
        "Users can choose which platform's caption to burn onto the video (Facebook, Instagram, or TikTok)",
        "The processed video maintains high quality and original resolution",
        "A download link or automatic download is provided for the captioned video file",
        "The exported video file is in MP4 format compatible with mobile devices and social media platforms",
        "Processing progress is displayed with a loading indicator",
        "Success and error states are communicated via toast notifications"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RepurposeModal.tsx",
          "operation": "modify",
          "description": "Add a platform selector (Radio Group or Tabs using shadcn/ui) to choose which platform's caption text to burn onto the video (Facebook, Instagram, or TikTok). Add an 'Export with Captions' button that calls useVideoProcessor hook with the video URL (via ExternalBlob.getDirectURL()), selected platform caption text, and overlay settings. Display processing progress with a loading indicator. Show success toast with download link on completion, and error toast on failure. Automatically trigger file download when processing completes."
        }
      ]
    }
  ]
}